{"config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 64, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "config": {"nb_row": 3, "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_1", "W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_filter": 32, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "bias": true}, "name": "convolution2d_1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"pool_size": [3, 3], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [3, 3]}, "name": "maxpooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "name": "activation_1", "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0]]], "config": {"nb_row": 3, "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_2", "W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_filter": 64, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "bias": true}, "name": "convolution2d_2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"pool_size": [3, 3], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "strides": [3, 3]}, "name": "maxpooling2d_2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "name": "activation_2", "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0]]], "config": {"nb_row": 2, "nb_col": 2, "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_3", "W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_filter": 128, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "bias": true}, "name": "convolution2d_3", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2]}, "name": "maxpooling2d_3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "name": "activation_3", "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0]]], "config": {"nb_row": 2, "nb_col": 2, "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_filter": 128, "activation": "linear", "activity_regularizer": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "bias": true}, "name": "convolution2d_4", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_4", "border_mode": "valid", "strides": [2, 2]}, "name": "maxpooling2d_4", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "name": "activation_4", "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"output_dim": 1000, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "input_dim": 128}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "name": "activation_5", "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0]]], "config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"output_dim": 500, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "input_dim": 1000}, "name": "dense_2", "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "name": "activation_6", "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0]]], "config": {"output_dim": 100, "b_regularizer": null, "W_regularizer": null, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "input_dim": 500}, "name": "dense_3", "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "name": "activation_7", "class_name": "Activation"}, {"inbound_nodes": [[["activation_7", 0, 0]]], "config": {"output_dim": 1, "b_regularizer": null, "W_regularizer": null, "name": "dense_4", "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "input_dim": 100}, "name": "dense_4", "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.1", "class_name": "Model"}