{"keras_version": "1.2.1", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 32, 64, 3], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "convolution2d_1", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "nb_filter": 64, "nb_col": 3, "activation": "linear", "nb_row": 3, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_2", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_2", "nb_filter": 16, "nb_col": 1, "activation": "linear", "nb_row": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "maxpooling2d_1", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "strides": [3, 3], "dim_ordering": "tf", "pool_size": [3, 3], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "convolution2d_3", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_3", "nb_filter": 128, "nb_col": 3, "activation": "linear", "nb_row": 3, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "convolution2d_4", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_4", "nb_filter": 32, "nb_col": 1, "activation": "linear", "nb_row": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "maxpooling2d_2", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "convolution2d_5", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_5", "nb_filter": 256, "nb_col": 3, "activation": "linear", "nb_row": 3, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"name": "convolution2d_6", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_6", "nb_filter": 64, "nb_col": 1, "activation": "linear", "nb_row": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "maxpooling2d_3", "config": {"name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "convolution2d_7", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_7", "nb_filter": 512, "nb_col": 3, "activation": "linear", "nb_row": 3, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"name": "convolution2d_8", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_8", "nb_filter": 128, "nb_col": 1, "activation": "linear", "nb_row": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "maxpooling2d_4", "config": {"name": "maxpooling2d_4", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "convolution2d_9", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_9", "nb_filter": 512, "nb_col": 3, "activation": "linear", "nb_row": 3, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"name": "convolution2d_10", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_10", "nb_filter": 128, "nb_col": 1, "activation": "linear", "nb_row": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "convolution2d_11", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_11", "nb_filter": 512, "nb_col": 5, "activation": "linear", "nb_row": 5, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "convolution2d_12", "config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "same", "name": "convolution2d_12", "nb_filter": 128, "nb_col": 1, "activation": "linear", "nb_row": 1, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["activation_6", 0, 0]]]}, {"name": "dense_1", "config": {"W_regularizer": null, "output_dim": 1024, "activation": "linear", "name": "dense_1", "input_dim": 256, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dropout_1", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["activation_7", 0, 0]]]}, {"name": "dense_2", "config": {"W_regularizer": null, "output_dim": 256, "activation": "linear", "name": "dense_2", "input_dim": 1024, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "dense_3", "config": {"W_regularizer": null, "output_dim": 64, "activation": "linear", "name": "dense_3", "input_dim": 256, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["activation_8", 0, 0]]]}, {"name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"name": "dense_4", "config": {"W_regularizer": null, "output_dim": 1, "activation": "linear", "name": "dense_4", "input_dim": 64, "W_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["activation_9", 0, 0]]]}], "output_layers": [["dense_4", 0, 0]]}, "class_name": "Model"}